Revit 2024 API
PartMakerMethodToDivideVolumes.IsValidSketchPlane Method
 Identifies if provided sketch plane is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidSketchPlane(
	Document document,
	ElementId sketchPlaneId
)
Visual Basic
Public Shared Function IsValidSketchPlane ( _
	document As Document, _
	sketchPlaneId As ElementId _
) As Boolean
Visual C++
public:
static bool IsValidSketchPlane(
	Document^ document,
	ElementId^ sketchPlaneId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
sketchPlaneId
Type: Autodesk.Revit.DB.ElementId
 SketchPlane ids to be tested for validity for PartMaker.
Return Value
 True if SketchPlane valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace